//-----------------------------------------------------------------------------------
//       Реализация класса BedPhysicsParams определяющего физические параметры задачи
//                                  интерфейсный класс моделя
//-----------------------------------------------------------------------------------
//                 Реализация библиотеки для моделирования 
//                  гидродинамических и русловых процессов
//-----------------------------------------------------------------------------------
//            Модуль BedLoadLibrary для расчета донных деформаций 
//                (учет движения только влекомых наносов)
//                              Потапов И.И.
//                              Снигур К. С.
//                        - (C) Copyright 2017 -
//                          ALL RIGHT RESERVED
//                               13.01.17
//-----------------------------------------------------------------------------------
using System;
using System.Linq;
using System.ComponentModel;
using System.Collections.Generic;

namespace RiverTaskLibrary
{
    [Serializable]
    /// <summary>
    /// Класс параметров для задачи о донных деформациях,
    /// предназначенный для работы с визуальными интерфейсами
    /// </summary>
    public class BedPhysicsParams_PPG : BedPhysicsParams
    {

    }

    
}
